In [2]:
import  pandas as pd

In [4]:
# create a data frame 
df = pd.DataFrame({
    'color' : ['red','blue','green','red','blue']
})

In [5]:
df.head()

   color
0    red
1   blue
2  green
3    red
4   blue

In [6]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [7]:
lbl_encoder.fit_transform(df[['color']])

/home/rohan/anaconda3/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 2, 0])

In [10]:
lbl_encoder.transform([['red']])

/home/rohan/anaconda3/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

In [12]:
lbl_encoder.transform([['blue']])

/home/rohan/anaconda3/lib/python3.12/site-packages/sklearn/preprocessing/_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([0])

## odinal encoding

In [13]:
import pandas  as pd

In [14]:
from sklearn.preprocessing import OrdinalEncoder

In [15]:
df=pd.DataFrame({
    'size':['small','medium','large','medium','small','large']
})

In [16]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [17]:
# create an instance of odianalencoder and perform fit_transform 

encoder =OrdinalEncoder(categories=[['small','medium','large']])

In [18]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [19]:
encoder.transform([['small']])

/home/rohan/anaconda3/lib/python3.12/site-packages/sklearn/base.py:493: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

## target encoder

In [24]:
import pandas as pd 

# create a simple data frame 

df = pd.DataFrame({
    'city': ['new york','london','paris','tokyo','new york','paris'],
    'price':[200,150,300,250,180,320]
})

In [25]:
df

       city  price
0  new york    200
1    london    150
2     paris    300
3     tokyo    250
4  new york    180
5     paris    320

In [28]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [29]:
mean_price

{'london': 150.0, 'new york': 190.0, 'paris': 310.0, 'tokyo': 250.0}

In [30]:
df['city_encoded']=df['city'].map(mean_price)

In [32]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0

## practise dataset

In [35]:
import seaborn as sns
df=sns.load_dataset('tips')

In [36]:
df[['total_bill','time']]

     total_bill    time
0         16.99  Dinner
1         10.34  Dinner
2         21.01  Dinner
3         23.68  Dinner
4         24.59  Dinner
..          ...     ...
239       29.03  Dinner
240       27.18  Dinner
241       22.67  Dinner
242       17.82  Dinner
243       18.78  Dinner

[244 rows x 2 columns]

In [41]:
mean_time = df.groupby('time', observed=False)['total_bill'].mean().to_dict()

In [42]:
mean_time

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [43]:
df['time_encoded']=df['time'].map(mean_time)

In [44]:
df[['total_bill','time_encoded']]

     total_bill time_encoded
0         16.99    20.797159
1         10.34    20.797159
2         21.01    20.797159
3         23.68    20.797159
4         24.59    20.797159
..          ...          ...
239       29.03    20.797159
240       27.18    20.797159
241       22.67    20.797159
242       17.82    20.797159
243       18.78    20.797159

[244 rows x 2 columns]